Revit 2024 API
BuiltInFailures.ImageFailures.InvalidWidth Property
 The image width must be must be no more than 30000 feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidWidth { get; }
Visual Basic
Public Shared ReadOnly Property InvalidWidth As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidWidth {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ImageFailures Class
Autodesk.Revit.DB Namespace